[
  {
    "id": "article_001",
    "title": "The Future of Artificial Intelligence in 2026",
    "content": "Artificial Intelligence has reached unprecedented capabilities in 2026. Recent breakthroughs in large language models have enabled more natural and context-aware conversations. However, concerns about AI safety and ethical implications continue to grow. Researchers emphasize the importance of developing responsible AI systems that align with human values.",
    "category": "technology",
    "metadata": {
      "source": "Tech News Daily",
      "date": "2026-02-01"
    }
  },
  {
    "id": "article_002",
    "title": "Digital Art Renaissance: How AI Tools Transform Creativity",
    "content": "The art world is experiencing a renaissance driven by AI-powered tools. Digital artists are now able to generate complex imagery, explore new styles, and push creative boundaries in ways never before possible. Critics argue this challenges traditional notions of artistry, while supporters celebrate the democratization of creative expression.",
    "category": "art",
    "metadata": {
      "source": "Creative Magazine",
      "date": "2026-01-15"
    }
  },
  {
    "id": "article_003",
    "title": "The Ethics of Autonomous Systems: A Philosophical Debate",
    "content": "As autonomous systems become more prevalent in society, philosophers and ethicists are engaged in intense debates about moral responsibility and decision-making. Who is responsible when an autonomous vehicle makes a critical error? How should we program ethical principles into machines? These questions challenge our fundamental understanding of agency and accountability.",
    "category": "philosophy",
    "metadata": {
      "source": "Philosophy Today",
      "date": "2026-01-20"
    }
  },
  {
    "id": "article_004",
    "title": "Breaking: Global Summit on Climate Action Reaches Historic Agreement",
    "content": "World leaders have reached a landmark agreement on climate action at the Global Summit. The agreement includes commitments to reduce carbon emissions by 50% by 2030 and transition to renewable energy sources. Environmental activists have cautiously welcomed the news, though many emphasize the importance of implementation and accountability.",
    "category": "news",
    "metadata": {
      "source": "World News Network",
      "date": "2026-02-10"
    }
  },
  {
    "id": "article_005",
    "title": "The Psychology of Social Media: Understanding Digital Interactions",
    "content": "Recent studies reveal how social media platforms shape our psychology and social behavior. Researchers have found that digital interactions can affect our self-esteem, relationships, and mental health in both positive and negative ways. Understanding these effects is crucial as we navigate an increasingly connected world.",
    "category": "psychology",
    "metadata": {
      "source": "Psychology Review",
      "date": "2026-01-28"
    }
  }
]
